src/Documents/Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Взаимодействие</Name>
			<Comment>Взаимодействие</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийЗвонокАбонент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийЗвонокНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗаписьНаСледующийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаимодействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Визит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонокВходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонокИсходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмоВходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмоИсходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/Взаимодействие/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИскомыйКлиент;     

#КонецОбласти

#Область ОбработчикиСобытийФоры

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Контрагент") Тогда 
		Объект.ЗадачаПредмет = Параметры.ЗначенияЗаполнения.Контрагент;
	КонецЕсли;
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработкиСтоматология.ПриСозданииНаСервере(ЭтаФорма);	
	
	Объект.ВидОперации   = ?(Параметры.Свойство("ВидОперации"),Параметры.ВидОперации,Объект.ВидОперации);
	Объект.ЗадачаПредмет = ?(Параметры.Свойство("Клиент"),Параметры.Клиент,Объект.ЗадачаПредмет);
	Объект.ВходящийЗвонокАбонент = Объект.ЗадачаПредмет;
    Объект.ВходящийЗвонокНомерТелефона = Объект.ЗадачаПредмет.Телефон;
	// Установка заголовка
	ЭтаФорма.Заголовок = Строка(Объект.ВидОперации);
		
	// Установка информации об авторе
	Элементы.ИнформацияАвтор.Заголовок = "Создано: " + Формат(Объект.Дата, "ДФ='дд ММММ ""в"" ЧЧ:мм, '") + Объект.АвторДокумента.Наименование;
//"Создано: "+Объект.АвторДокумента.Наименование+", "+Строка(Объект.Дата);
		
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);

	ГруппаКонтрагентов = Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);	
	
	Если Параметры.Свойство("Основание") И ЗначениеЗаполнено(Параметры.Основание) И ТипЗнч(Параметры.Основание) = Тип("Структура")
		И Объект.ВидОперации = Перечисления.ВидыОперацийВзаимодействия.ТелефонныйЗвонокВходящий Тогда
		
			Параметры.Основание.Свойство("ВходящийЗвонокАбонент"      ,Объект.ВходящийЗвонокАбонент);
			Параметры.Основание.Свойство("ВходящийЗвонокНомерТелефона",Объект.ВходящийЗвонокНомерТелефона);
			Параметры.Основание.Свойство("ИсточникИнформации"         ,Объект.ИсточникИнформации);
			
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(Объект.ПредварительнаяЗаписьНаСледующийПрием) Тогда	
		Элементы.ДекорацияПЗНаСледующийприем.Заголовок = СформироватьПредставлениеПЗ(Объект.ПредварительнаяЗаписьНаСледующийПрием);
	КонецЕсли;
	Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
	
КонецПроцедуры

&НаКлиенте
// Обработчик при открытии формы на клиенте
//
Процедура ПриОткрытии(Отказ)
	
    ОбновитьОтображениеДанных();	
	
	Если Объект.ИсточникИнформации = ПредопределенноеЗначение("Справочник.РекламныеИсточники.ДругойПациент") Тогда
		Элементы.ИсточникИнформацииКлиент.Видимость = Истина;
	Иначе
		Элементы.ИсточникИнформацииКлиент.Видимость = Ложь;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
// Обработчик при записи на сервре 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ОбновитьСпискиВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ТекущаяСтрока", Объект.ЗадачаПредмет);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", ПараметрыОткрытия,,,,,Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры  

&НаКлиенте 
// Процедура, Обработчик события "СтруктурнаяЕдиницаНадписьНажатие". 
//
Процедура СтруктурнаяЕдиницаНадписьНажатие(Элемент)  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
    СтруктураПараметров.Вставить("Ссылка", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы()); 
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров,,,,,Новый ОписаниеОповещения("СтруктурнаяЕдиницаНадписьНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		

КонецПроцедуры

&НаКлиенте 
// Процедура, Обработчик события "КонтрагентПриИзменении" элемента.
//
Процедура КонтрагентПриИзменении(Элемент) 
	
	ОбновитьТелефонныйНомерПоКлиенту(); 
	
КонецПроцедуры  

&НаКлиенте 
// Процедура, Обработчик события "ИсточникИнформацииПриИзменении" Элемента.
//
Процедура ИсточникИнформацииПриИзменении(Элемент)
	
	Если Объект.ИсточникИнформации = ПредопределенноеЗначение("Справочник.РекламныеИсточники.ДругойПациент") Тогда
		Элементы.ИсточникИнформацииКлиент.Видимость = Истина;
	Иначе
		Элементы.ИсточникИнформацииКлиент.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, Обработчик события "ИсточникИнформацииКлиентНачалоВыбора"
//
Процедура ИсточникИнформацииКлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ТекущаяСтрока", Объект.ИсточникИнформацииКлиент);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", ПараметрыОткрытия,,,,,Новый ОписаниеОповещения("ИсточникИнформацииКлиентНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора"
//
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "СоздатьНовогоКлиента" Тогда		
		ДобавитьИВыбратьКонтрагента();
		ВыбранноеЗначение = Объект.ЗадачаПредмет;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор"
//
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	ДанныеВыбора         = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина);
	ИскомыйКлиент		 = Текст;
	
КонецПроцедуры

&НаКлиенте
// Обработчик декорации создания  ПЗ на след. прием
//
Процедура ДекорацияПЗНаСледующийприемНажатие(Элемент)
	
	// Если предварительная запись еще не создана откр. форму создания
	Если НЕ ЗначениеЗаполнено(Объект.ПредварительнаяЗаписьНаСледующийПрием) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент"              ,Объект.ЗадачаПредмет);
		ПараметрыФормы.Вставить("ИмяКонтрагента"          ,Объект.ВходящийЗвонокАбонент);
		ПараметрыФормы.Вставить("ТелефонКонтрагента"      ,Объект.ВходящийЗвонокНомерТелефона);
		ПараметрыФормы.Вставить("ЗакрытьПриСозданииЗаписи",Истина);
		
		ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаПредварительнойЗаписи");
		ОткрытьФорму(ИмяФормыПланировщика, ПараметрыФормы,,,,,Новый ОписаниеОповещения("ДекорацияПЗНаСледующийприемНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		// Если предварительная запись создана открываем форму доккумента
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Объект.ПредварительнаяЗаписьНаСледующийПрием));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Телефонный номер обработка автоподбора
//
Процедура ТелефонАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем список номеров и клиентов
	СписокНомеров = ПолучитьСписокТелефонныхНомеров(Текст);
	
	Если СписокНомеров.Количество() = 1 Тогда
		
		Объект.ВходящийЗвонокНомерТелефона = СписокНомеров[0].Значение.НомерТелефона;
		Объект.ВходящийЗвонокАбонент       = Строка(СписокНомеров[0].Значение.Клиент);
		Объект.ЗадачаПредмет               = СписокНомеров[0].Значение.Клиент;

	ИначеЕсли  СписокНомеров.Количество() > 1 Тогда

		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ТелефонАвтоПодборЗавершение", ЭтотОбъект), СписокНомеров, Элемент,СписокНомеров[0]);
		
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Телефон авто подбор завершение
//
// Параметры:
//  ВыбранноеЗначение		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ТелефонАвтоПодборЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
		
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Объект.ВходящийЗвонокНомерТелефона = ВыбранноеЗначение.Значение.НомерТелефона;
		Объект.ВходящийЗвонокАбонент       = Строка(ВыбранноеЗначение.Значение.Клиент);
		Объект.ЗадачаПредмет               = ВыбранноеЗначение.Значение.Клиент;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти  

#Область ОбработчикКомандФормы

&НаКлиенте
// Процедура, обработчик события нажатие кнопки "ДобавитьКлиента"
//
Процедура ДобавитьКлиента(Команда)
	
	ОсновнаяПапкаКлиентов = Неопределено; 
	
	СписокФИО = ОбщегоНазначенияКлиент.СтрокаВСписок(Объект.ВходящийЗвонокАбонент," ");
	СтруктураЗаполнения = Новый структура;
	Для А = 0 По СписокФИО.Количество()-1 Цикл
		
		Если А = 0 Тогда
			СтруктураЗаполнения.Вставить("Фамилия",СписокФИО[А].Значение);
		ИначеЕсли А = 1 Тогда
			СтруктураЗаполнения.Вставить("Имя",СписокФИО[А].Значение);
		ИначеЕсли А = 2 Тогда
			СтруктураЗаполнения.Вставить("Отчество",СписокФИО[А].Значение);
		КонецЕсли;
		
	КонецЦикла;
			
	ГруппаКлиентов = ОбщегоНазначенияСтоматология.ВернутьГруппуКлиентов();  
	СтруктураЗаполнения.Вставить("Родитель", ?(ЗначениеЗаполнено(ГруппаКлиентов), ГруппаКлиентов, ГруппаКонтрагентов)); 
	  
	ОписаниеОповещения = Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", СтруктураЗаполнения,,,,, ОписаниеОповещения);   
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "ЗаписатьИЗакрыть"
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = ЭтаФорма.Записать();
	Если Отказ Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СпециальныеОбработчики

&НаКлиенте
// Обработчик открытия формы кэш списка вводимых значений
//
Процедура Подключаемый_ОбработчикКэшЛист(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ИдентификаторПоля", ЭтаФорма.ИмяФормы + "." +Элемент.Имя); 
	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСохраняемыхЗначений",
	ПараметрыФормы,,,,,
	Новый ОписаниеОповещения("Подключаемый_ОбработчикКэшЛистЗавершение", ЭтотОбъект), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	// СохранениеВводимыхЗначенийКлиент.ОбработчикВызоваФормыРедактированияКэшСписка(Элемент,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора банковского счета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура Подключаемый_ОбработчикКэшЛистЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Объект.Задача = РезультатВыбора;
		Модифицированность = Истина;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияПЗНаСледующийприемНажатиеЗавершение"
//
Процедура ДекорацияПЗНаСледующийприемНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПредварительнаяЗаписьНаСледующийПрием = Результат;
		Элементы.ДекорацияПЗНаСледующийприем.Заголовок = СформироватьПредставлениеПЗ(Объект.ПредварительнаяЗаписьНаСледующийПрием);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "КонтрагентНачалоВыбораЗавершение"
//
Процедура КонтрагентНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ЗадачаПредмет = Результат;
		ОбновитьТелефонныйНомерПоКлиенту();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить и выбрать контрагента завершение
// 
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
// 
Процедура ДобавитьИВыбратьКонтрагентаЗавершение(Результат, Параметры) Экспорт
	
	Если Не Результат.Пустая() Тогда
		Объект.Контрагент = Результат;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "ИсточникИнформацииКлиентНачалоВыбораЗавершение"
//
Процедура ИсточникИнформацииКлиентНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ИсточникИнформацииКлиент = Результат;		
	КонецЕсли;	

КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "СтруктурнаяЕдиницаНадписьНажатиеЗавершение"
//
Процедура СтруктурнаяЕдиницаНадписьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
	   Если Объект.СтруктурнаяЕдиница <> Результат Тогда
	     Объект.СтруктурнаяЕдиница = Результат;
	     Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
	   КонецЕсли;
   КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Вернет список клиентов по части телефонного номера 
//
Функция ПолучитьСписокТелефонныхНомеров(Номер)
	 
	// Получаем список клиентов по части телефонного номера
	НайденныеКлиенты = Справочники.МедицинскиеКарты.ПолучитьКонтрагентовПоНомеруТелефона(Номер, Истина);	
	СписокНомеров    = Новый СписокЗначений;
	
	Для Каждого Клиент Из НайденныеКлиенты Цикл
		
		СписокНомеров.Добавить(Новый Структура("Клиент,НомерТелефона",Клиент.Клиент, Клиент.НомерТелефона),Клиент.НомерТелефона+" " + Строка(Клиент.Клиент));
		
	КонецЦикла;

	Возврат СписокНомеров;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды ДобавитьИВыбратьКонтрагента
//
Процедура ДобавитьИВыбратьКонтрагента()
	
	ПараметрыОткрытия = Новый Структура;
	ГруппаКлиентов = ОбщегоНазначенияСтоматология.ВернутьГруппуКлиентов();
 
	ПараметрыОткрытия.Вставить("Родитель", ?(ЗначениеЗаполнено(ГруппаКлиентов), ГруппаКлиентов, ГруппаКонтрагентов));
	ПараметрыОткрытия.Вставить("ТекстЗаполнения", ИскомыйКлиент);  
	ПараметрыЗаполнения = Новый Структура("Основание", ПараметрыОткрытия);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИВыбратьКонтрагентаЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", ПараметрыЗаполнения,,,,,ОписаниеОповещения);
	
КонецПроцедуры  

&НаСервере
// Веренет таблицу сохраняемых элементов
//
Функция ЭлементыДляСохранения()
	
	СохраняемыеЭлементы = Новый Структура("Контрагент,Задача",Объект.ЗадачаПредмет,Объект.Задача);
	
	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраненяемыхЭлементов(СохраняемыеЭлементы);
	
КонецФункции

&НаСервереБезконтекста
// Сформировать представление ссылки на ПЗ
//
Функция СформироватьПредставлениеПЗ(ДокСсылка)
	
	Если ДокСсылка.Услуги.Количество() > 0 Тогда
		Возврат "Запись на " + Формат(ДокСсылка.Услуги[0].ДатаНачала,"ДФ='dd MMMM yyyy H:mm'"); 
	Иначе
		Возврат Строка(ДокСсылка);
	КонецЕсли;

КонецФункции

&НаКлиенте
// Процедура, Обработчик события "ОбновитьТелефонныйНомерПоКлиенту".
//
Процедура ОбновитьТелефонныйНомерПоКлиенту()
	
	Если ТипЗнч(Объект.ЗадачаПредмет) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если Не ЗначениеЗаполнено(Объект.ВходящийЗвонокНомерТелефона) Тогда 
			Объект.ВходящийЗвонокНомерТелефона = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ЗадачаПредмет, "Телефон");
		КонецЕсли;
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаимодействия.ТелефонныйЗвонокВходящий") И Не ЗначениеЗаполнено(Объект.ВходящийЗвонокАбонент) Тогда
			Объект.ВходящийЗвонокАбонент = Строка(Объект.ЗадачаПредмет);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
